app/Controllers/AuthController.php

    public function login()
    {
        // Recuperer le numero saisi dans le formulaire
        $numero = $this->request->getPost('numero_telephone');

        // ---- Validation du numero ----
        if (empty($numero) || strlen($numero) < 10) {
            return redirect()->back()
                             ->with('error', 'Numero de telephone invalide (minimum 10 chiffres)');
        }

        // ---- Verification du prefixe ----
        // Extraire les 3 premiers chiffres (ex: "033", "037")
        $prefixe = substr($numero, 0, 3);

        $db = \Config\Database::connect();
        $prefixeExiste = $db->table('prefixes')
                            ->where('prefixe', $prefixe)
                            ->get()
                            ->getRowArray();
---
SELECT *
FROM `prefixes`
WHERE `prefixe` = '032'