app/Controllers/CompteController.php

SELECT *
FROM `clients`
WHERE `clients`.`id_client` = 2
---
    public function index()
    {
        $clientModel = new ClientModel();

        // Recuperer l'ID du client connecte depuis la session
        $idClient = session()->get('id_client');

        // Recuperer les informations completes du client
        $client = $clientModel->find($idClient);