app/Controllers/TransactionController.php

SELECT *
FROM `types_operation`
WHERE `code` = 'RETRAIT'
---
    public function retrait()
    {
        $clientModel = new ClientModel();
        $idClient = session()->get('id_client');

        // --- Traitement du formulaire (POST) ---
        if ($this->request->getMethod() === 'POST') {
            $montant = (float) $this->request->getPost('montant');

            // Validation : le montant doit etre positif
            if ($montant <= 0) {
                return redirect()->back()
                                 ->with('error', 'Le montant doit etre superieur a 0');
            }

            // Calculer le solde actuel du client
            $solde = $clientModel->getSolde($idClient);

            // Recuperer l'ID du type d'operation RETRAIT
            $db = \Config\Database::connect();
            $type = $db->table('types_operation')
                       ->where('code', 'RETRAIT')
                       ->get()
                       ->getRowArray();

SELECT *
FROM `clients`
WHERE `clients`.`id_client` = 2
---
            }

            // Verifier qu'aucun numero n'est celui de l'emetteur
            $emetteur = $clientModel->find($idClient);