app/Models/ClientModel.php

SELECT *
FROM `clients`
WHERE `numero_telephone` = '0345678901'
 LIMIT 1
---
    public function findByTelephone(string $numero): ?array
    {
        return $this->where('numero_telephone', $numero)->first();