app/Models/TransactionModel.php

SELECT *
FROM `types_operation`
WHERE `code` = 'RETRAIT'
INSERT INTO `transactions` (`id_client_emetteur`, `id_type`, `montant`, `frais`, `montant_total`, `statut`) VALUES (4, 2, 2000, 50, 2050, 'reussi')
---
    public function insererRetrait(int $idClient, float $montant, float $frais): int|false
    {
        // Recuperer l'ID du type d'operation 'RETRAIT'
        $db = \Config\Database::connect();
        $type = $db->table('types_operation')
                   ->where('code', 'RETRAIT')
                   ->get()
                   ->getRowArray();

        if (!$type) {
            return false; // Type RETRAIT introuvable en base
        }

        // Inserer la transaction de retrait
        $this->insert([
            'id_client_emetteur' => $idClient,
            'id_type'            => $type['id_type'],
            'montant'            => $montant,
            'frais'              => $frais,
            'montant_total'      => $montant + $frais, // Total debite du solde
            'statut'             => 'reussi',          // Retrait automatique
        ]);

SELECT *
FROM `types_operation`
WHERE `code` = 'RETRAIT'
---
    public function envoiMultiple(int $idEmetteur, array $numeros, float $montantTotal, bool $inclureFraisRetrait = false): array
    {
        $clientModel = new ClientModel();
        $baremeFraisModel = new BaremeFraisModel();
        $db = \Config\Database::connect();

        // Nombre de destinataires
        $nbDestinataires = count($numeros);

        // Montant par destinataire (division equitable)
        $montantParDest = floor($montantTotal / $nbDestinataires);

        // Recuperer les types d'operation
        $typeTransfert = $db->table('types_operation')
                            ->where('code', 'TRANSFERT')
                            ->get()
                            ->getRowArray();

SELECT *
FROM `prefixes`
WHERE `prefixe` = '034'
---

            // Verifier le prefixe
            $prefixe = substr($numero, 0, 3);
            $prefixeExiste = $db->table('prefixes')
                                ->where('prefixe', $prefixe)
                                ->get()
                                ->getRowArray();

INSERT INTO `transactions` (`id_client_emetteur`, `id_client_destinataire`, `id_type`, `montant`, `frais`, `montant_total`, `statut`) VALUES (2, 6, 3, 2000, 100, 2100, 'reussi')
---
        // Phase 3 : Inserer toutes les transactions
        $details = [];
        foreach ($destinations as $dest) {
            $this->insert([
                'id_client_emetteur'     => $idEmetteur,
                'id_client_destinataire' => $dest['id_destinataire'],
                'id_type'                => $typeTransfert['id_type'],
                'montant'                => $dest['montant'],
                'frais'                  => $dest['frais_total'],
                'montant_total'          => $dest['montant'] + $dest['frais_total'],
                'statut'                 => 'reussi',
            ]);

SELECT `t`.*, `tp`.`libelle` as `type_libelle`, `tp`.`code` as `type_code`
FROM `transactions` `t`
JOIN `types_operation` `tp` ON `tp`.`id_type` = `t`.`id_type`
WHERE   (
`t`.`id_client_emetteur` = 4
OR `t`.`id_client_destinataire` = 4
 )
ORDER BY `t`.`date_transaction` DESC
---
    public function getHistorique(int $idClient): array
    {
        $db = \Config\Database::connect();

        // Requete pour recuperer toutes les transactions du client
        // On joint la table types_operation pour avoir le libelle et le code
        return $db->table('transactions t')
                  ->select('t.*, tp.libelle as type_libelle, tp.code as type_code')
                  ->join('types_operation tp', 'tp.id_type = t.id_type')
                  // Le client peut etre emetteur OU destinataire
                  ->groupStart()
                      ->where('t.id_client_emetteur', $idClient)
                      ->orWhere('t.id_client_destinataire', $idClient)
                  ->groupEnd()
                  // Trier par date decroissante (les plus recentes en premier)
                  ->orderBy('t.date_transaction', 'DESC')
                  ->get()
                  ->getResultArray();